*** mesh/mesh-repair/src/adjacency.rs:100:41: replace == with != in MeshAdjacency::boundary_edge_count

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace == with != in MeshAdjacency::boundary_edge_count
@@ -92,17 +92,17 @@
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of boundary edges.
     #[must_use]
     pub fn boundary_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()
-            .filter(|faces| faces.len() == 1)
+            .filter(|faces| faces.len() != /* ~ changed by cargo-mutants ~ */ 1)
             .count()
     }
 
     /// Iterate over all non-manifold edges (edges with more than two adjacent faces).
     pub fn non_manifold_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()
             .filter(|(_, faces)| faces.len() > 2)

---- adjacency::tests::boundary_edges_single_triangle stdout ----

thread 'adjacency::tests::boundary_edges_single_triangle' (674875) panicked at mesh/mesh-repair/src/adjacency.rs:220:9:
assertion `left == right` failed
  left: 0
 right: 3

---- adjacency::tests::boundary_edges_two_triangles stdout ----

thread 'adjacency::tests::boundary_edges_two_triangles' (674876) panicked at mesh/mesh-repair/src/adjacency.rs:230:9:
assertion `left == right` failed
  left: 1
 right: 4

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (674962) panicked at mesh/mesh-repair/src/validate.rs:637:9:
has_issues likewise excludes winding at this rung

failures:
    adjacency::tests::boundary_edges_single_triangle
    adjacency::tests::boundary_edges_two_triangles
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects
    validate::tests::validate_single_triangle
    validate::tests::validate_tetrahedron

test result: FAILED. 111 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
