*** mesh/mesh-repair/src/adjacency.rs:108:46: replace > with == in MeshAdjacency::non_manifold_edges

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace > with == in MeshAdjacency::non_manifold_edges
@@ -100,17 +100,17 @@
             .filter(|faces| faces.len() == 1)
             .count()
     }
 
     /// Iterate over all non-manifold edges (edges with more than two adjacent faces).
     pub fn non_manifold_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()
-            .filter(|(_, faces)| faces.len() > 2)
+            .filter(|(_, faces)| faces.len() == /* ~ changed by cargo-mutants ~ */ 2)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of non-manifold edges.
     #[must_use]
     pub fn non_manifold_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()

*** result: Success
