*** mesh/mesh-repair/src/adjacency.rs:115:9: replace MeshAdjacency::non_manifold_edge_count -> usize with 0

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::non_manifold_edge_count -> usize with 0
@@ -107,20 +107,17 @@
             .iter()
             .filter(|(_, faces)| faces.len() > 2)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of non-manifold edges.
     #[must_use]
     pub fn non_manifold_edge_count(&self) -> usize {
-        self.edge_to_faces
-            .values()
-            .filter(|faces| faces.len() > 2)
-            .count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }

---- adjacency::tests::non_manifold_detection stdout ----

thread 'adjacency::tests::non_manifold_detection' (683953) panicked at mesh/mesh-repair/src/adjacency.rs:236:9:
assertion `left == right` failed
  left: 0
 right: 1

---- validate::tests::issue_count_sums_the_connectivity_and_geometry_defects stdout ----

thread 'validate::tests::issue_count_sums_the_connectivity_and_geometry_defects' (684042) panicked at mesh/mesh-repair/src/validate.rs:996:9:
every term must be non-zero

---- validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges stdout ----

thread 'validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges' (684047) panicked at mesh/mesh-repair/src/validate.rs:883:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    adjacency::tests::non_manifold_detection
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects
    validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
