*** mesh/mesh-repair/src/adjacency.rs:115:9: replace MeshAdjacency::non_manifold_edge_count -> usize with 1

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::non_manifold_edge_count -> usize with 1
@@ -107,20 +107,17 @@
             .iter()
             .filter(|(_, faces)| faces.len() > 2)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of non-manifold edges.
     #[must_use]
     pub fn non_manifold_edge_count(&self) -> usize {
-        self.edge_to_faces
-            .values()
-            .filter(|faces| faces.len() > 2)
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (684896) panicked at mesh/mesh-repair/src/validate.rs:637:9:
has_issues likewise excludes winding at this rung

---- validate::tests::has_issues_empty_mesh stdout ----

thread 'validate::tests::has_issues_empty_mesh' (684904) panicked at mesh/mesh-repair/src/validate.rs:933:9:
assertion failed: !validate_mesh(&IndexedMesh::new()).has_issues()

failures:
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::has_issues_empty_mesh

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
