*** mesh/mesh-repair/src/adjacency.rs:117:41: replace > with < in MeshAdjacency::non_manifold_edge_count

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace > with < in MeshAdjacency::non_manifold_edge_count
@@ -109,17 +109,17 @@
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of non-manifold edges.
     #[must_use]
     pub fn non_manifold_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()
-            .filter(|faces| faces.len() > 2)
+            .filter(|faces| faces.len() < /* ~ changed by cargo-mutants ~ */ 2)
             .count()
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }

---- adjacency::tests::non_manifold_detection stdout ----

thread 'adjacency::tests::non_manifold_detection' (686600) panicked at mesh/mesh-repair/src/adjacency.rs:239:9:
assertion `left == right` failed
  left: 6
 right: 1

---- validate::tests::issue_count_sums_the_connectivity_and_geometry_defects stdout ----

thread 'validate::tests::issue_count_sums_the_connectivity_and_geometry_defects' (686689) panicked at mesh/mesh-repair/src/validate.rs:999:17:
assertion `left != right` failed: terms 0 and 1 both equal 15; substituting one for the other in `issue_count` would leave the total unchanged
  left: 15
 right: 15

failures:
    adjacency::tests::non_manifold_detection
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
