*** mesh/mesh-repair/src/adjacency.rs:117:41: replace > with >= in MeshAdjacency::non_manifold_edge_count

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace > with >= in MeshAdjacency::non_manifold_edge_count
@@ -109,17 +109,17 @@
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of non-manifold edges.
     #[must_use]
     pub fn non_manifold_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()
-            .filter(|faces| faces.len() > 2)
+            .filter(|faces| faces.len() >= /* ~ changed by cargo-mutants ~ */ 2)
             .count()
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (687555) panicked at mesh/mesh-repair/src/validate.rs:637:9:
has_issues likewise excludes winding at this rung

---- validate::tests::issue_count_sums_the_connectivity_and_geometry_defects stdout ----

thread 'validate::tests::issue_count_sums_the_connectivity_and_geometry_defects' (687564) panicked at mesh/mesh-repair/src/validate.rs:1009:9:
assertion `left == right` failed
  left: 27
 right: 21

---- validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges stdout ----

thread 'validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges' (687569) panicked at mesh/mesh-repair/src/validate.rs:883:9:
assertion `left == right` failed
  left: 6
 right: 1

failures:
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects
    validate::tests::the_census_and_the_report_disagree_on_non_manifold_edges

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
