*** mesh/mesh-repair/src/adjacency.rs:124:9: replace MeshAdjacency::is_manifold -> bool with true

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::is_manifold -> bool with true
@@ -116,17 +116,17 @@
             .values()
             .filter(|faces| faces.len() > 2)
             .count()
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
-        self.edge_to_faces.values().all(|faces| faces.len() <= 2)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the mesh is watertight (no boundary edges).
     #[must_use]
     pub fn is_watertight(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() >= 2)
     }

---- adjacency::tests::non_manifold_detection stdout ----

thread 'adjacency::tests::non_manifold_detection' (688340) panicked at mesh/mesh-repair/src/adjacency.rs:240:9:
assertion failed: !adj.is_manifold()

---- validate::tests::printability_fails_on_non_manifold_alone stdout ----

thread 'validate::tests::printability_fails_on_non_manifold_alone' (688431) panicked at mesh/mesh-repair/src/validate.rs:562:9:
assertion failed: !report.is_manifold

failures:
    adjacency::tests::non_manifold_detection
    validate::tests::printability_fails_on_non_manifold_alone

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
