*** mesh/mesh-repair/src/adjacency.rs:124:9: replace MeshAdjacency::is_manifold -> bool with false

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::is_manifold -> bool with false
@@ -116,17 +116,17 @@
             .values()
             .filter(|faces| faces.len() > 2)
             .count()
     }
 
     /// Check if the mesh is manifold (all edges have at most 2 adjacent faces).
     #[must_use]
     pub fn is_manifold(&self) -> bool {
-        self.edge_to_faces.values().all(|faces| faces.len() <= 2)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the mesh is watertight (no boundary edges).
     #[must_use]
     pub fn is_watertight(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() >= 2)
     }

---- adjacency::tests::manifold_mesh stdout ----

thread 'adjacency::tests::manifold_mesh' (689206) panicked at mesh/mesh-repair/src/adjacency.rs:248:9:
assertion failed: adj.is_manifold()

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (689287) panicked at mesh/mesh-repair/src/validate.rs:633:9:
is_printable is deliberately still winding-blind at this rung

---- validate::tests::printability_check stdout ----

thread 'validate::tests::printability_check' (689297) panicked at mesh/mesh-repair/src/validate.rs:513:9:
assertion failed: report.is_printable()

failures:
    adjacency::tests::manifold_mesh
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::printability_check
    validate::tests::the_option_gates_the_census_and_leaves_the_volume_flag_measured
    validate::tests::validate_tetrahedron

test result: FAILED. 112 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
