*** mesh/mesh-repair/src/adjacency.rs:130:61: replace >= with < in MeshAdjacency::is_watertight

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace >= with < in MeshAdjacency::is_watertight
@@ -122,17 +122,17 @@
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }
 
     /// Check if the mesh is watertight (no boundary edges).
     #[must_use]
     pub fn is_watertight(&self) -> bool {
-        self.edge_to_faces.values().all(|faces| faces.len() >= 2)
+        self.edge_to_faces.values().all(|faces| faces.len() < /* ~ changed by cargo-mutants ~ */ 2)
     }
 
     /// Get the total number of edges.
     #[must_use]
     pub fn edge_count(&self) -> usize {
         self.edge_to_faces.len()
     }

---- adjacency::tests::boundary_edges_single_triangle stdout ----

thread 'adjacency::tests::boundary_edges_single_triangle' (692737) panicked at mesh/mesh-repair/src/adjacency.rs:221:9:
assertion failed: !adj.is_watertight()

---- holes::tests::test_fill_holes_open_box stdout ----

thread 'holes::tests::test_fill_holes_open_box' (692765) panicked at mesh/mesh-repair/src/holes.rs:530:9:
assertion failed: adjacency.is_watertight()

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (692824) panicked at mesh/mesh-repair/src/validate.rs:633:9:
is_printable is deliberately still winding-blind at this rung

failures:
    adjacency::tests::boundary_edges_single_triangle
    holes::tests::test_fill_holes_open_box
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::printability_check
    validate::tests::printability_fails_on_non_manifold_alone
    validate::tests::printability_fails_with_holes
    validate::tests::report_display
    validate::tests::the_option_gates_the_census_and_leaves_the_volume_flag_measured
    validate::tests::validate_single_triangle
    validate::tests::validate_tetrahedron

test result: FAILED. 107 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
