*** mesh/mesh-repair/src/adjacency.rs:130:9: replace MeshAdjacency::is_watertight -> bool with true

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::is_watertight -> bool with true
@@ -122,17 +122,17 @@
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }
 
     /// Check if the mesh is watertight (no boundary edges).
     #[must_use]
     pub fn is_watertight(&self) -> bool {
-        self.edge_to_faces.values().all(|faces| faces.len() >= 2)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the total number of edges.
     #[must_use]
     pub fn edge_count(&self) -> usize {
         self.edge_to_faces.len()
     }

---- adjacency::tests::boundary_edges_single_triangle stdout ----

thread 'adjacency::tests::boundary_edges_single_triangle' (690982) panicked at mesh/mesh-repair/src/adjacency.rs:221:9:
assertion failed: !adj.is_watertight()

---- validate::tests::printability_fails_with_holes stdout ----

thread 'validate::tests::printability_fails_with_holes' (691081) panicked at mesh/mesh-repair/src/validate.rs:572:9:
assertion failed: !report.is_printable()

---- validate::tests::report_display stdout ----

thread 'validate::tests::report_display' (691082) panicked at mesh/mesh-repair/src/validate.rs:582:9:
assertion failed: display.contains("Watertight: No")

failures:
    adjacency::tests::boundary_edges_single_triangle
    validate::tests::printability_fails_with_holes
    validate::tests::report_display
    validate::tests::validate_single_triangle

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
