*** mesh/mesh-repair/src/adjacency.rs:130:9: replace MeshAdjacency::is_watertight -> bool with false

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::is_watertight -> bool with false
@@ -122,17 +122,17 @@
     #[must_use]
     pub fn is_manifold(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() <= 2)
     }
 
     /// Check if the mesh is watertight (no boundary edges).
     #[must_use]
     pub fn is_watertight(&self) -> bool {
-        self.edge_to_faces.values().all(|faces| faces.len() >= 2)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the total number of edges.
     #[must_use]
     pub fn edge_count(&self) -> usize {
         self.edge_to_faces.len()
     }

---- holes::tests::test_fill_holes_open_box stdout ----

thread 'holes::tests::test_fill_holes_open_box' (691898) panicked at mesh/mesh-repair/src/holes.rs:530:9:
assertion failed: adjacency.is_watertight()

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (691957) panicked at mesh/mesh-repair/src/validate.rs:633:9:
is_printable is deliberately still winding-blind at this rung

---- validate::tests::printability_check stdout ----

thread 'validate::tests::printability_check' (691967) panicked at mesh/mesh-repair/src/validate.rs:513:9:
assertion failed: report.is_printable()

failures:
    holes::tests::test_fill_holes_open_box
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::printability_check
    validate::tests::printability_fails_on_non_manifold_alone
    validate::tests::the_option_gates_the_census_and_leaves_the_volume_flag_measured
    validate::tests::validate_tetrahedron

test result: FAILED. 111 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
