*** mesh/mesh-repair/src/adjacency.rs:136:9: replace MeshAdjacency::edge_count -> usize with 0

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::edge_count -> usize with 0
@@ -128,17 +128,17 @@
     #[must_use]
     pub fn is_watertight(&self) -> bool {
         self.edge_to_faces.values().all(|faces| faces.len() >= 2)
     }
 
     /// Get the total number of edges.
     #[must_use]
     pub fn edge_count(&self) -> usize {
-        self.edge_to_faces.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the number of unique vertices.
     #[must_use]
     pub fn vertex_count(&self) -> usize {
         self.vertex_to_faces.len()
     }
 }

---- adjacency::tests::build_single_triangle stdout ----

thread 'adjacency::tests::build_single_triangle' (693626) panicked at mesh/mesh-repair/src/adjacency.rs:180:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    adjacency::tests::build_single_triangle

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
