*** mesh/mesh-repair/src/adjacency.rs:142:9: replace MeshAdjacency::vertex_count -> usize with 0

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::vertex_count -> usize with 0
@@ -134,17 +134,17 @@
     #[must_use]
     pub fn edge_count(&self) -> usize {
         self.edge_to_faces.len()
     }
 
     /// Get the number of unique vertices.
     #[must_use]
     pub fn vertex_count(&self) -> usize {
-        self.vertex_to_faces.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Normalize edge direction so v0 < v1.
 #[inline]
 const fn normalize_edge(v0: u32, v1: u32) -> (u32, u32) {
     if v0 < v1 { (v0, v1) } else { (v1, v0) }
 }

---- adjacency::tests::build_single_triangle stdout ----

thread 'adjacency::tests::build_single_triangle' (695373) panicked at mesh/mesh-repair/src/adjacency.rs:181:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    adjacency::tests::build_single_triangle

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
