*** mesh/mesh-repair/src/adjacency.rs:149:11: replace < with == in normalize_edge

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace < with == in normalize_edge
@@ -141,17 +141,17 @@
     pub fn vertex_count(&self) -> usize {
         self.vertex_to_faces.len()
     }
 }
 
 /// Normalize edge direction so v0 < v1.
 #[inline]
 const fn normalize_edge(v0: u32, v1: u32) -> (u32, u32) {
-    if v0 < v1 { (v0, v1) } else { (v1, v0) }
+    if v0 == /* ~ changed by cargo-mutants ~ */ v1 { (v0, v1) } else { (v1, v0) }
 }
 
 #[cfg(test)]
 #[allow(
     // Tests legitimately use `.unwrap()` to assert an Option is Some.
     // Workspace lints flip this to deny in production code, but the
     // test mod is exempt.
     clippy::unwrap_used

---- adjacency::tests::faces_for_edge stdout ----

thread 'adjacency::tests::faces_for_edge' (700570) panicked at mesh/mesh-repair/src/adjacency.rs:192:9:
assertion `left == right` failed
  left: 1
 right: 2

---- adjacency::tests::edge_direction_normalization stdout ----

thread 'adjacency::tests::edge_direction_normalization' (700569) panicked at mesh/mesh-repair/src/adjacency.rs:259:9:
assertion `left == right` failed
  left: Some([0])
 right: None

---- components::tests::test_connected_triangles stdout ----

thread 'components::tests::test_connected_triangles' (700577) panicked at mesh/mesh-repair/src/components.rs:581:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    adjacency::tests::boundary_edges_two_triangles
    adjacency::tests::edge_direction_normalization
    adjacency::tests::faces_for_edge
    components::tests::test_component_analysis_display
    components::tests::test_connected_triangles
    components::tests::test_keep_largest_multiple_components
    components::tests::test_remove_small_components_all_removed
    components::tests::test_remove_small_components_some_removed
    components::tests::test_three_components_sorted_by_size
    holes::tests::test_detect_holes_closed_box
    holes::tests::test_detect_holes_open_box
    holes::tests::test_fill_holes_open_box

test result: FAILED. 97 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
