*** mesh/mesh-repair/src/adjacency.rs:149:11: replace < with > in normalize_edge

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace < with > in normalize_edge
@@ -141,17 +141,17 @@
     pub fn vertex_count(&self) -> usize {
         self.vertex_to_faces.len()
     }
 }
 
 /// Normalize edge direction so v0 < v1.
 #[inline]
 const fn normalize_edge(v0: u32, v1: u32) -> (u32, u32) {
-    if v0 < v1 { (v0, v1) } else { (v1, v0) }
+    if v0 > /* ~ changed by cargo-mutants ~ */ v1 { (v0, v1) } else { (v1, v0) }
 }
 
 #[cfg(test)]
 #[allow(
     // Tests legitimately use `.unwrap()` to assert an Option is Some.
     // Workspace lints flip this to deny in production code, but the
     // test mod is exempt.
     clippy::unwrap_used

*** result: Success
