*** mesh/mesh-repair/src/adjacency.rs:149:5: replace normalize_edge -> (u32, u32) with (1, 1)

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace normalize_edge -> (u32, u32) with (1, 1)
@@ -141,17 +141,17 @@
     pub fn vertex_count(&self) -> usize {
         self.vertex_to_faces.len()
     }
 }
 
 /// Normalize edge direction so v0 < v1.
 #[inline]
 const fn normalize_edge(v0: u32, v1: u32) -> (u32, u32) {
-    if v0 < v1 { (v0, v1) } else { (v1, v0) }
+    (1, 1) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     // Tests legitimately use `.unwrap()` to assert an Option is Some.
     // Workspace lints flip this to deny in production code, but the
     // test mod is exempt.
     clippy::unwrap_used

---- adjacency::tests::faces_for_edge stdout ----

thread 'adjacency::tests::faces_for_edge' (699719) panicked at mesh/mesh-repair/src/adjacency.rs:192:9:
assertion `left == right` failed
  left: 6
 right: 2

---- adjacency::tests::boundary_edges_two_triangles stdout ----

thread 'adjacency::tests::boundary_edges_two_triangles' (699716) panicked at mesh/mesh-repair/src/adjacency.rs:230:9:
assertion `left == right` failed
  left: 0
 right: 4

---- adjacency::tests::build_single_triangle stdout ----

thread 'adjacency::tests::build_single_triangle' (699717) panicked at mesh/mesh-repair/src/adjacency.rs:180:9:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    adjacency::tests::boundary_edges_single_triangle
    adjacency::tests::boundary_edges_two_triangles
    adjacency::tests::build_single_triangle
    adjacency::tests::faces_for_edge
    adjacency::tests::manifold_mesh
    adjacency::tests::nonexistent_edge
    components::tests::test_component_analysis_display
    components::tests::test_keep_largest_multiple_components
    components::tests::test_remove_small_components_all_removed
    components::tests::test_remove_small_components_some_removed
    components::tests::test_split_two_components
    components::tests::test_three_components_sorted_by_size

test result: FAILED. 91 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
