*** mesh/mesh-repair/src/adjacency.rs:73:9: replace MeshAdjacency::faces_for_edge -> Option<&[usize]> with None

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::faces_for_edge -> Option<&[usize]> with None
@@ -65,18 +65,17 @@
         }
     }
 
     /// Get faces adjacent to an edge.
     ///
     /// Returns `None` if the edge doesn't exist in the mesh.
     #[must_use]
     pub fn faces_for_edge(&self, v0: u32, v1: u32) -> Option<&[usize]> {
-        let edge = normalize_edge(v0, v1);
-        self.edge_to_faces.get(&edge).map(Vec::as_slice)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get faces adjacent to a vertex.
     ///
     /// Returns an empty slice if the vertex has no adjacent faces.
     #[must_use]
     pub fn faces_for_vertex(&self, v: u32) -> &[usize] {
         self.vertex_to_faces.get(&v).map_or(&[], Vec::as_slice)

---- components::tests::test_three_components_sorted_by_size stdout ----

thread 'components::tests::test_three_components_sorted_by_size' (661159) panicked at mesh/mesh-repair/src/components.rs:590:9:
assertion `left == right` failed
  left: 4
 right: 3

---- components::tests::test_component_analysis_display stdout ----

thread 'components::tests::test_component_analysis_display' (661147) panicked at mesh/mesh-repair/src/components.rs:679:9:
assertion failed: output.contains("Connected components: 3")

---- components::tests::test_remove_small_components_some_removed stdout ----

thread 'components::tests::test_remove_small_components_some_removed' (661154) panicked at mesh/mesh-repair/src/components.rs:661:9:
assertion `left == right` failed
  left: 4
 right: 2

failures:
    adjacency::tests::faces_for_edge
    components::tests::test_component_analysis_display
    components::tests::test_connected_triangles
    components::tests::test_keep_largest_multiple_components
    components::tests::test_remove_small_components_all_removed
    components::tests::test_remove_small_components_some_removed
    components::tests::test_three_components_sorted_by_size
    winding::tests::a_non_orientable_surface_never_censuses_clean_however_often_it_is_repaired
    winding::tests::test_count_inconsistent
    winding::tests::test_fix_disconnected_components
    winding::tests::test_fix_inconsistent
    winding::tests::winding_census_counts_three_edges_per_flipped_face_wherever_it_sits

test result: FAILED. 105 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
