*** mesh/mesh-repair/src/adjacency.rs:73:9: replace MeshAdjacency::faces_for_edge -> Option<&[usize]> with Some(Vec::leak(vec![1]))

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::faces_for_edge -> Option<&[usize]> with Some(Vec::leak(vec![1]))
@@ -65,18 +65,17 @@
         }
     }
 
     /// Get faces adjacent to an edge.
     ///
     /// Returns `None` if the edge doesn't exist in the mesh.
     #[must_use]
     pub fn faces_for_edge(&self, v0: u32, v1: u32) -> Option<&[usize]> {
-        let edge = normalize_edge(v0, v1);
-        self.edge_to_faces.get(&edge).map(Vec::as_slice)
+        Some(Vec::leak(vec![1])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get faces adjacent to a vertex.
     ///
     /// Returns an empty slice if the vertex has no adjacent faces.
     #[must_use]
     pub fn faces_for_vertex(&self, v: u32) -> &[usize] {
         self.vertex_to_faces.get(&v).map_or(&[], Vec::as_slice)

---- components::tests::test_two_disconnected_components stdout ----

thread 'components::tests::test_two_disconnected_components' (663817) panicked at mesh/mesh-repair/src/components.rs:571:9:
assertion `left == right` failed
  left: 1
 right: 2

---- adjacency::tests::nonexistent_edge stdout ----

thread 'adjacency::tests::nonexistent_edge' (663802) panicked at mesh/mesh-repair/src/adjacency.rs:266:9:
assertion failed: adj.faces_for_edge(0, 5).is_none()

---- components::tests::test_keep_largest_single_component stdout ----

thread 'components::tests::test_keep_largest_single_component' (663808) panicked at mesh/mesh-repair/src/components.rs:181:28:
index out of bounds: the len is 1 but the index is 1

failures:
    adjacency::tests::faces_for_edge
    adjacency::tests::nonexistent_edge
    components::tests::test_keep_largest_single_component
    components::tests::test_single_component
    components::tests::test_split_single_component
    components::tests::test_split_two_components
    components::tests::test_two_disconnected_components
    winding::tests::a_non_orientable_surface_never_censuses_clean_however_often_it_is_repaired
    winding::tests::test_fix_disconnected_components
    winding::tests::test_single_face
    winding::tests::winding_census_counts_three_edges_per_flipped_face_wherever_it_sits

test result: FAILED. 106 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
