*** mesh/mesh-repair/src/adjacency.rs:82:9: replace MeshAdjacency::faces_for_vertex -> &[usize] with Vec::leak(vec![0])

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::faces_for_vertex -> &[usize] with Vec::leak(vec![0])
@@ -74,17 +74,17 @@
         self.edge_to_faces.get(&edge).map(Vec::as_slice)
     }
 
     /// Get faces adjacent to a vertex.
     ///
     /// Returns an empty slice if the vertex has no adjacent faces.
     #[must_use]
     pub fn faces_for_vertex(&self, v: u32) -> &[usize] {
-        self.vertex_to_faces.get(&v).map_or(&[], Vec::as_slice)
+        Vec::leak(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterate over all boundary edges (edges with exactly one adjacent face).
     ///
     /// Boundary edges indicate holes in the mesh surface.
     pub fn boundary_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()

---- adjacency::tests::nonexistent_vertex stdout ----

thread 'adjacency::tests::nonexistent_vertex' (665612) panicked at mesh/mesh-repair/src/adjacency.rs:275:9:
assertion `left == right` failed
  left: 1
 right: 0

---- adjacency::tests::faces_for_vertex stdout ----

thread 'adjacency::tests::faces_for_vertex' (665608) panicked at mesh/mesh-repair/src/adjacency.rs:207:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    adjacency::tests::faces_for_vertex
    adjacency::tests::nonexistent_vertex

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
