*** mesh/mesh-repair/src/adjacency.rs:89:9: replace MeshAdjacency::boundary_edges -> impl Iterator<Item =(u32, u32)>+'_ with ::std::iter::once((1, 0))

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::boundary_edges -> impl Iterator<Item =(u32, u32)>+'_ with ::std::iter::once((1, 0))
@@ -81,20 +81,17 @@
     pub fn faces_for_vertex(&self, v: u32) -> &[usize] {
         self.vertex_to_faces.get(&v).map_or(&[], Vec::as_slice)
     }
 
     /// Iterate over all boundary edges (edges with exactly one adjacent face).
     ///
     /// Boundary edges indicate holes in the mesh surface.
     pub fn boundary_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
-        self.edge_to_faces
-            .iter()
-            .filter(|(_, faces)| faces.len() == 1)
-            .map(|(&edge, _)| edge)
+        ::std::iter::once((1, 0)) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Count the number of boundary edges.
     #[must_use]
     pub fn boundary_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()
             .filter(|faces| faces.len() == 1)

---- holes::tests::test_detect_holes_open_box stdout ----

thread 'holes::tests::test_detect_holes_open_box' (670346) panicked at mesh/mesh-repair/src/holes.rs:504:9:
assertion `left == right` failed
  left: 0
 right: 1

---- holes::tests::test_single_triangle_has_boundary stdout ----

thread 'holes::tests::test_single_triangle_has_boundary' (670349) panicked at mesh/mesh-repair/src/holes.rs:556:9:
assertion `left == right` failed
  left: 0
 right: 1

---- holes::tests::test_fill_holes_open_box stdout ----

thread 'holes::tests::test_fill_holes_open_box' (670348) panicked at mesh/mesh-repair/src/holes.rs:525:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    holes::tests::test_detect_holes_open_box
    holes::tests::test_fill_holes_open_box
    holes::tests::test_single_triangle_has_boundary

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
