*** mesh/mesh-repair/src/adjacency.rs:91:46: replace == with != in MeshAdjacency::boundary_edges

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace == with != in MeshAdjacency::boundary_edges
@@ -83,17 +83,17 @@
     }
 
     /// Iterate over all boundary edges (edges with exactly one adjacent face).
     ///
     /// Boundary edges indicate holes in the mesh surface.
     pub fn boundary_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()
-            .filter(|(_, faces)| faces.len() == 1)
+            .filter(|(_, faces)| faces.len() != /* ~ changed by cargo-mutants ~ */ 1)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of boundary edges.
     #[must_use]
     pub fn boundary_edge_count(&self) -> usize {
         self.edge_to_faces
             .values()

---- holes::tests::test_detect_holes_open_box stdout ----

thread 'holes::tests::test_detect_holes_open_box' (672224) panicked at mesh/mesh-repair/src/holes.rs:505:9:
assertion `left == right` failed
  left: 7
 right: 4

---- holes::tests::test_fill_holes_open_box stdout ----

thread 'holes::tests::test_fill_holes_open_box' (672226) panicked at mesh/mesh-repair/src/holes.rs:530:9:
assertion failed: adjacency.is_watertight()

---- holes::tests::test_single_triangle_has_boundary stdout ----

thread 'holes::tests::test_single_triangle_has_boundary' (672227) panicked at mesh/mesh-repair/src/holes.rs:556:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    holes::tests::test_detect_holes_closed_box
    holes::tests::test_detect_holes_open_box
    holes::tests::test_fill_holes_open_box
    holes::tests::test_single_triangle_has_boundary

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
