*** mesh/mesh-repair/src/adjacency.rs:98:9: replace MeshAdjacency::boundary_edge_count -> usize with 0

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::boundary_edge_count -> usize with 0
@@ -90,20 +90,17 @@
             .iter()
             .filter(|(_, faces)| faces.len() == 1)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of boundary edges.
     #[must_use]
     pub fn boundary_edge_count(&self) -> usize {
-        self.edge_to_faces
-            .values()
-            .filter(|faces| faces.len() == 1)
-            .count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterate over all non-manifold edges (edges with more than two adjacent faces).
     pub fn non_manifold_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()
             .filter(|(_, faces)| faces.len() > 2)
             .map(|(&edge, _)| edge)

---- adjacency::tests::boundary_edges_two_triangles stdout ----

thread 'adjacency::tests::boundary_edges_two_triangles' (673089) panicked at mesh/mesh-repair/src/adjacency.rs:227:9:
assertion `left == right` failed
  left: 0
 right: 4

---- adjacency::tests::boundary_edges_single_triangle stdout ----

thread 'adjacency::tests::boundary_edges_single_triangle' (673088) panicked at mesh/mesh-repair/src/adjacency.rs:217:9:
assertion `left == right` failed
  left: 0
 right: 3

---- validate::tests::issue_count_sums_the_connectivity_and_geometry_defects stdout ----

thread 'validate::tests::issue_count_sums_the_connectivity_and_geometry_defects' (673184) panicked at mesh/mesh-repair/src/validate.rs:996:9:
every term must be non-zero

failures:
    adjacency::tests::boundary_edges_single_triangle
    adjacency::tests::boundary_edges_two_triangles
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects
    validate::tests::validate_single_triangle

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
