*** mesh/mesh-repair/src/adjacency.rs:98:9: replace MeshAdjacency::boundary_edge_count -> usize with 1

*** mutation diff:
--- mesh/mesh-repair/src/adjacency.rs
+++ replace MeshAdjacency::boundary_edge_count -> usize with 1
@@ -90,20 +90,17 @@
             .iter()
             .filter(|(_, faces)| faces.len() == 1)
             .map(|(&edge, _)| edge)
     }
 
     /// Count the number of boundary edges.
     #[must_use]
     pub fn boundary_edge_count(&self) -> usize {
-        self.edge_to_faces
-            .values()
-            .filter(|faces| faces.len() == 1)
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterate over all non-manifold edges (edges with more than two adjacent faces).
     pub fn non_manifold_edges(&self) -> impl Iterator<Item = (u32, u32)> + '_ {
         self.edge_to_faces
             .iter()
             .filter(|(_, faces)| faces.len() > 2)
             .map(|(&edge, _)| edge)

---- adjacency::tests::boundary_edges_two_triangles stdout ----

thread 'adjacency::tests::boundary_edges_two_triangles' (673967) panicked at mesh/mesh-repair/src/adjacency.rs:227:9:
assertion `left == right` failed
  left: 1
 right: 4

---- adjacency::tests::boundary_edges_single_triangle stdout ----

thread 'adjacency::tests::boundary_edges_single_triangle' (673966) panicked at mesh/mesh-repair/src/adjacency.rs:217:9:
assertion `left == right` failed
  left: 1
 right: 3

---- validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses stdout ----

thread 'validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses' (674053) panicked at mesh/mesh-repair/src/validate.rs:637:9:
has_issues likewise excludes winding at this rung

failures:
    adjacency::tests::boundary_edges_single_triangle
    adjacency::tests::boundary_edges_two_triangles
    validate::tests::census_sees_a_local_flip_that_the_signed_volume_test_misses
    validate::tests::has_issues_empty_mesh
    validate::tests::issue_count_sums_the_connectivity_and_geometry_defects
    validate::tests::validate_single_triangle
    validate::tests::validate_tetrahedron

test result: FAILED. 110 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
