*** mesh/mesh-repair/src/components.rs:151:37: replace + with - in find_connected_components

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace + with - in find_connected_components
@@ -143,17 +143,17 @@
     let face_count = mesh.faces.len();
 
     // Build face-to-face adjacency via shared edges
     let mut face_neighbors: Vec<Vec<u32>> = vec![Vec::new(); face_count];
     for (face_idx, face) in mesh.faces.iter().enumerate() {
         // Check all three edges of this face
         for edge_idx in 0..3 {
             let v0 = face[edge_idx];
-            let v1 = face[(edge_idx + 1) % 3];
+            let v1 = face[(edge_idx - /* ~ changed by cargo-mutants ~ */ 1) % 3];
 
             if let Some(neighbors) = adjacency.faces_for_edge(v0, v1) {
                 for &neighbor in neighbors {
                     if neighbor != face_idx {
                         face_neighbors[face_idx].push(neighbor as u32);
                     }
                 }
             }

*** result: Success
