*** mesh/mesh-repair/src/components.rs:151:37: replace + with * in find_connected_components

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace + with * in find_connected_components
@@ -143,17 +143,17 @@
     let face_count = mesh.faces.len();
 
     // Build face-to-face adjacency via shared edges
     let mut face_neighbors: Vec<Vec<u32>> = vec![Vec::new(); face_count];
     for (face_idx, face) in mesh.faces.iter().enumerate() {
         // Check all three edges of this face
         for edge_idx in 0..3 {
             let v0 = face[edge_idx];
-            let v1 = face[(edge_idx + 1) % 3];
+            let v1 = face[(edge_idx * /* ~ changed by cargo-mutants ~ */ 1) % 3];
 
             if let Some(neighbors) = adjacency.faces_for_edge(v0, v1) {
                 for &neighbor in neighbors {
                     if neighbor != face_idx {
                         face_neighbors[face_idx].push(neighbor as u32);
                     }
                 }
             }

---- components::tests::test_component_analysis_display stdout ----

thread 'components::tests::test_component_analysis_display' (718772) panicked at mesh/mesh-repair/src/components.rs:679:9:
assertion failed: output.contains("Connected components: 3")

---- components::tests::test_connected_triangles stdout ----

thread 'components::tests::test_connected_triangles' (718773) panicked at mesh/mesh-repair/src/components.rs:581:9:
assertion `left == right` failed
  left: 2
 right: 1

---- components::tests::test_keep_largest_multiple_components stdout ----

thread 'components::tests::test_keep_largest_multiple_components' (718775) panicked at mesh/mesh-repair/src/components.rs:645:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    components::tests::test_component_analysis_display
    components::tests::test_connected_triangles
    components::tests::test_keep_largest_multiple_components
    components::tests::test_remove_small_components_all_removed
    components::tests::test_remove_small_components_some_removed
    components::tests::test_three_components_sorted_by_size

test result: FAILED. 111 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
