*** mesh/mesh-repair/src/components.rs:151:42: replace % with + in find_connected_components

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace % with + in find_connected_components
@@ -143,17 +143,17 @@
     let face_count = mesh.faces.len();
 
     // Build face-to-face adjacency via shared edges
     let mut face_neighbors: Vec<Vec<u32>> = vec![Vec::new(); face_count];
     for (face_idx, face) in mesh.faces.iter().enumerate() {
         // Check all three edges of this face
         for edge_idx in 0..3 {
             let v0 = face[edge_idx];
-            let v1 = face[(edge_idx + 1) % 3];
+            let v1 = face[(edge_idx + 1) + /* ~ changed by cargo-mutants ~ */ 3];
 
             if let Some(neighbors) = adjacency.faces_for_edge(v0, v1) {
                 for &neighbor in neighbors {
                     if neighbor != face_idx {
                         face_neighbors[face_idx].push(neighbor as u32);
                     }
                 }
             }

---- components::tests::test_remove_small_components_none_removed stdout ----

thread 'components::tests::test_remove_small_components_none_removed' (716880) panicked at mesh/mesh-repair/src/components.rs:151:22:
index out of bounds: the len is 3 but the index is 4

---- components::tests::test_three_components_sorted_by_size stdout ----

thread 'components::tests::test_three_components_sorted_by_size' (716886) panicked at mesh/mesh-repair/src/components.rs:151:22:
index out of bounds: the len is 3 but the index is 4

---- components::tests::test_remove_small_components_all_removed stdout ----

thread 'components::tests::test_remove_small_components_all_removed' (716879) panicked at mesh/mesh-repair/src/components.rs:151:22:
index out of bounds: the len is 3 but the index is 4

failures:
    components::tests::test_component_analysis_display
    components::tests::test_connected_triangles
    components::tests::test_keep_largest_multiple_components
    components::tests::test_keep_largest_single_component
    components::tests::test_remove_small_components_all_removed
    components::tests::test_remove_small_components_none_removed
    components::tests::test_remove_small_components_some_removed
    components::tests::test_single_component
    components::tests::test_split_preserves_geometry
    components::tests::test_split_single_component
    components::tests::test_split_two_components
    components::tests::test_three_components_sorted_by_size

test result: FAILED. 104 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
