*** mesh/mesh-repair/src/components.rs:181:20: delete ! in find_connected_components

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ delete ! in find_connected_components
@@ -173,17 +173,17 @@
         let mut component = Vec::new();
         let mut queue = vec![start_face as u32];
         visited[start_face] = true;
 
         while let Some(face_idx) = queue.pop() {
             component.push(face_idx);
 
             for &neighbor in &face_neighbors[face_idx as usize] {
-                if !visited[neighbor as usize] {
+                if  /* ~ changed by cargo-mutants ~ */visited[neighbor as usize] {
                     visited[neighbor as usize] = true;
                     queue.push(neighbor);
                 }
             }
         }
 
         components.push(component);
     }

*** result: Success
