*** mesh/mesh-repair/src/components.rs:62:30: replace == with != in ComponentAnalysis::is_connected

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace == with != in ComponentAnalysis::is_connected
@@ -54,17 +54,17 @@
     /// Size of the smallest component (number of faces).
     pub smallest_component_size: usize,
 }
 
 impl ComponentAnalysis {
     /// Check if the mesh is fully connected (single component).
     #[must_use]
     pub const fn is_connected(&self) -> bool {
-        self.component_count == 1
+        self.component_count != /* ~ changed by cargo-mutants ~ */ 1
     }
 
     /// Get the face indices of the largest component.
     #[must_use]
     pub fn largest_component(&self) -> &[u32] {
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }

---- components::tests::test_empty_mesh stdout ----

thread 'components::tests::test_empty_mesh' (705209) panicked at mesh/mesh-repair/src/components.rs:555:9:
assertion failed: !analysis.is_connected()

---- components::tests::test_connected_triangles stdout ----

thread 'components::tests::test_connected_triangles' (705208) panicked at mesh/mesh-repair/src/components.rs:582:9:
assertion failed: analysis.is_connected()

---- components::tests::test_single_component stdout ----

thread 'components::tests::test_single_component' (705215) panicked at mesh/mesh-repair/src/components.rs:563:9:
assertion failed: analysis.is_connected()

failures:
    components::tests::test_connected_triangles
    components::tests::test_empty_mesh
    components::tests::test_single_component
    components::tests::test_two_disconnected_components

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
