*** mesh/mesh-repair/src/components.rs:62:9: replace ComponentAnalysis::is_connected -> bool with true

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace ComponentAnalysis::is_connected -> bool with true
@@ -54,17 +54,17 @@
     /// Size of the smallest component (number of faces).
     pub smallest_component_size: usize,
 }
 
 impl ComponentAnalysis {
     /// Check if the mesh is fully connected (single component).
     #[must_use]
     pub const fn is_connected(&self) -> bool {
-        self.component_count == 1
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the face indices of the largest component.
     #[must_use]
     pub fn largest_component(&self) -> &[u32] {
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }

---- components::tests::test_empty_mesh stdout ----

thread 'components::tests::test_empty_mesh' (703496) panicked at mesh/mesh-repair/src/components.rs:555:9:
assertion failed: !analysis.is_connected()

---- components::tests::test_two_disconnected_components stdout ----

thread 'components::tests::test_two_disconnected_components' (703507) panicked at mesh/mesh-repair/src/components.rs:572:9:
assertion failed: !analysis.is_connected()

failures:
    components::tests::test_empty_mesh
    components::tests::test_two_disconnected_components

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
