*** mesh/mesh-repair/src/components.rs:62:9: replace ComponentAnalysis::is_connected -> bool with false

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace ComponentAnalysis::is_connected -> bool with false
@@ -54,17 +54,17 @@
     /// Size of the smallest component (number of faces).
     pub smallest_component_size: usize,
 }
 
 impl ComponentAnalysis {
     /// Check if the mesh is fully connected (single component).
     #[must_use]
     pub const fn is_connected(&self) -> bool {
-        self.component_count == 1
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the face indices of the largest component.
     #[must_use]
     pub fn largest_component(&self) -> &[u32] {
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }

---- components::tests::test_connected_triangles stdout ----

thread 'components::tests::test_connected_triangles' (704347) panicked at mesh/mesh-repair/src/components.rs:582:9:
assertion failed: analysis.is_connected()

---- components::tests::test_single_component stdout ----

thread 'components::tests::test_single_component' (704354) panicked at mesh/mesh-repair/src/components.rs:563:9:
assertion failed: analysis.is_connected()

failures:
    components::tests::test_connected_triangles
    components::tests::test_single_component

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
