*** mesh/mesh-repair/src/components.rs:68:9: replace ComponentAnalysis::largest_component -> &[u32] with Vec::leak(Vec::new())

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace ComponentAnalysis::largest_component -> &[u32] with Vec::leak(Vec::new())
@@ -60,17 +60,17 @@
     #[must_use]
     pub const fn is_connected(&self) -> bool {
         self.component_count == 1
     }
 
     /// Get the face indices of the largest component.
     #[must_use]
     pub fn largest_component(&self) -> &[u32] {
-        self.components.first().map_or(&[], Vec::as_slice)
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for ComponentAnalysis {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         writeln!(f, "Component Analysis:")?;
         writeln!(f, "  Connected components: {}", self.component_count)?;
         if self.component_count > 0 {

*** result: Success
