*** mesh/mesh-repair/src/components.rs:74:9: replace <impl std::fmt::Display for ComponentAnalysis>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace <impl std::fmt::Display for ComponentAnalysis>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -66,37 +66,17 @@
     #[must_use]
     pub fn largest_component(&self) -> &[u32] {
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }
 
 impl std::fmt::Display for ComponentAnalysis {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        writeln!(f, "Component Analysis:")?;
-        writeln!(f, "  Connected components: {}", self.component_count)?;
-        if self.component_count > 0 {
-            writeln!(
-                f,
-                "  Largest component: {} faces",
-                self.largest_component_size
-            )?;
-            writeln!(
-                f,
-                "  Smallest component: {} faces",
-                self.smallest_component_size
-            )?;
-            if self.component_count > 1 {
-                writeln!(f, "  Component sizes:")?;
-                for (i, comp) in self.components.iter().enumerate() {
-                    writeln!(f, "    Component {}: {} faces", i + 1, comp.len())?;
-                }
-            }
-        }
-        Ok(())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Find all connected components in a mesh.
 ///
 /// Uses a flood-fill algorithm starting from each unvisited face.
 /// Two faces are connected if they share an edge.
 ///

---- components::tests::test_component_analysis_display stdout ----

thread 'components::tests::test_component_analysis_display' (709134) panicked at mesh/mesh-repair/src/components.rs:659:9:
assertion failed: output.contains("Connected components: 3")

failures:
    components::tests::test_component_analysis_display

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
