*** mesh/mesh-repair/src/components.rs:76:33: replace > with == in <impl std::fmt::Display for ComponentAnalysis>::fmt

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace > with == in <impl std::fmt::Display for ComponentAnalysis>::fmt
@@ -68,17 +68,17 @@
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }
 
 impl std::fmt::Display for ComponentAnalysis {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         writeln!(f, "Component Analysis:")?;
         writeln!(f, "  Connected components: {}", self.component_count)?;
-        if self.component_count > 0 {
+        if self.component_count == /* ~ changed by cargo-mutants ~ */ 0 {
             writeln!(
                 f,
                 "  Largest component: {} faces",
                 self.largest_component_size
             )?;
             writeln!(
                 f,
                 "  Smallest component: {} faces",

---- components::tests::test_component_analysis_display stdout ----

thread 'components::tests::test_component_analysis_display' (710009) panicked at mesh/mesh-repair/src/components.rs:680:9:
assertion failed: output.contains("Largest component: 2 faces")

failures:
    components::tests::test_component_analysis_display

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
