*** mesh/mesh-repair/src/components.rs:76:33: replace > with >= in <impl std::fmt::Display for ComponentAnalysis>::fmt

*** mutation diff:
--- mesh/mesh-repair/src/components.rs
+++ replace > with >= in <impl std::fmt::Display for ComponentAnalysis>::fmt
@@ -68,17 +68,17 @@
         self.components.first().map_or(&[], Vec::as_slice)
     }
 }
 
 impl std::fmt::Display for ComponentAnalysis {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         writeln!(f, "Component Analysis:")?;
         writeln!(f, "  Connected components: {}", self.component_count)?;
-        if self.component_count > 0 {
+        if self.component_count >= /* ~ changed by cargo-mutants ~ */ 0 {
             writeln!(
                 f,
                 "  Largest component: {} faces",
                 self.largest_component_size
             )?;
             writeln!(
                 f,
                 "  Smallest component: {} faces",

*** result: Success
